---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Railing.Flipped
zh: 栏杆
source: html/3e0d0aea-7bfc-ac33-405e-2e26cbdc6e8f.htm
---
# Autodesk.Revit.DB.Architecture.Railing.Flipped Property

**中文**: 栏杆

Indicates if the railing is flipped.

## Syntax (C#)
```csharp
public bool Flipped { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The railing has incorrect internal data.